Beam System Tags can only be placed in plan , elevation and 3D views.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BeamSystemTagBadView { get; }
  Visual Basic
Public Shared ReadOnly Property BeamSystemTagBadView As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BeamSystemTagBadView {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures BeamSystemFailures Class
  Autodesk.Revit.DB Namespace